Repository: tixsys/esteid
Catalog: macosx/trunk/Updater/*.lproj/KeychainTool.strings
Languages: et

# KeychainTool.Action.Cancel
source: Cancel
et: Katkesta

# KeychainTool.Action.Close
source: Close
et: Sulge

# KeychainTool.Action.Next
source: Next
et: Edasi

# KeychainTool.Action.Save
source: Confirm
et: Kinnita

# KeychainTool.Action.Retry
source: Try Again
et: Proovi uuesti

# KeychainTool.Alert.CardNotFound.Message
source: Please make sure that your ID-card is inserted to the card reader and then try again.
et: Palun kontrolli kas ID-kaart on kaardilugejasse sisestatud ja seejärel proovi uuesti.

# KeychainTool.Alert.CardNotFound.Title
source: Failed to read authentification certificate.
et: Autentimissertifikaadi lugemine ebaõnnestus

# KeychainTool.Alert.InvalidURL.Title
source: Invalid website address
et: Mittesobiv veebiaadress

# KeychainTool.Alert.InvalidURL.Message
source: '%@' is not a valid website address.
et: '%@' ei ole sobiv veebiaadress.

# KeychainTool.Alert.SaveFailure.Title
source: Save Failed
et: Salvestamine ebaõnnestus

# KeychainTool.Alert.SaveFailure.Message
source: Couldn't save the new list of websites.
et: Ei õnnestunud salvestada uut nimekirja veebiaadressidega.

# KeychainTool.Alert.SaveSuccess.Title
source: Save Succeeded
et: Salvestamine õnnestus

# KeychainTool.Alert.SaveSuccess.Message
source: Saved the new list of websites successfully!
et: Uue veebiaadresside nimekirja salvestamine õnnestus!

# KeychainTool.Placeholder.Website
source: Insert a new website here
et: Sisesta uus veebisait siia (https://...)

# KeychainTool.Title
source: Estonian ID-card Keychain Tool
et: Eesti ID-kaardi Keychain Abivahend
