Repository: tixsys/esteid
Catalog: macosx/trunk/Updater/*.lproj/PreferencePane.strings
Languages: et

# PreferencePane.Action.CheckNow
source: Check For Updates
et: Kontrolli uuendusi

# PreferencePane.Action.Cancel
source: Cancel
et: Katkesta

# PreferencePane.Action.KeychainTool
source: Keychain Tool
et: Keychain abivahend

# PreferencePane.Action.Retry
source: Try Again
et: Proovi uuesti

# PreferencePane.Action.UpdateFrequencyNever
source: Don't check for updates automatically
et: Ära kontrolli automaatselt uuendusi

# PreferencePane.Action.UpdateFrequencyDaily
source: Check for updates every day
et: Kontrolli uuendusi iga päev

# PreferencePane.Action.UpdateFrequencyWeekly
source: Check for updates every week
et: Kontrolli uuendusi iga nädal

# PreferencePane.Action.UpdateFrequencyMonthly
source: Check for updates every month
et: Kontrolli uuendusi iga kuu

# PreferencePane.Alert.IdLogin.CardNotFound.Message
source: Please make sure that your ID-card is inserted to the card reader and then try again.
et: Palun kontrolli kas ID-kaart on kaardilugejasse sisestatud ja seejärel proovi uuesti.

# PreferencePane.Alert.IdLogin.CardNotFound.Title
source: Failed to enable id-card login.
et: ID-kaardiga login seadistamine ebaõnnestus!

# PreferencePane.Label.InstalledSoftware
source: Installed software:
et: Paigaldatud tarkvara:

# PreferencePane.Label.NoInstalledSoftware
source: No installed software!
et: Ei leidnud paigaldatud tarkvara!

# PreferencePane.Label.Version
source: %@ (version %@)
et: %@ (versioon %@)
