Repository: tixsys/esteid
Catalog: plugins/acrobat/trunk/EstEIDSigner/Properties/Resources.*.resx
Languages: ru_ru

# CARD_TOKEN_INFO
source: GetTokenInfo {0} failed
ru_ru: Ошибка {0} токена

# CERT_DONT_MATCH
source: Certificates don't match
ru_ru: Сертификаты не совпадают

# INVALID_CERT
source: Invalid certificate
ru_ru: Неверный сертификат

# CARD_HASH_UPDATE
source: Card hash update error
ru_ru: Ошибка обновления хэша карты

# CERT_MISSING
source: Certificate missing
ru_ru: Сертификат отсутствует

# CARD_HASH_FINALIZE
source: Card has finalize error
ru_ru: Ошибка завершиения хэша карты

# CERTS_MISSING
source: No valid certificates found on smartcard
ru_ru: На смарткарте не найдено действительных сертификатов

# CARD_MISSING
source: No ID-card found
ru_ru: ID-карта не найдена

# MEMORY_ERROR
source: Not enough memory
ru_ru: Недостаточно памяти

# PKCS11_OPEN
source: PKCS#11 open failed
ru_ru: Неуспешное открытие PKCS#11

# ACTION_CANCELED
source: Signing cancelled
ru_ru: Подписывание прервано

# CERT_READ_FAILURE
source: Reading certificate failed
ru_ru: Неуспешное чтение сертификата

# CARD_HASH_INIT
source: Card hash initialize error
ru_ru: Ошибка хэша карты

# TSA_ERROR
source: Timestamp error:
ru_ru: Ошибка временной печати:

# CARD_INTERNAL_ERROR
source: Smartcard error
ru_ru: Ошибка карты

# NO_PIN_SUPPLIED
source: PIN empty
ru_ru: Пустой PIN

# DEFAULT_CONFIG
source: <?xml version="1.0" encoding="utf-8"?> <configuration> <appSettings> <add key="pkcs11_library" value="opensc-pkcs11.dll" /> <add key="debug" value="false" /> <add key="ocsp_url" value="http://ocsp.sk.ee" /> <add key="cert_path" value="\certs" /> <add key="enable_tsa" value="False" /> <add key="visible_signature" value="False" /> <add key="tsa_url" value="http://www.edelweb.fr/cgi-bin/service-tsp" /> <add key="tsa_user" value="" /> <add key="tsa_password" value="" /> <add key="help_url" value="http://support.sk.ee/" /> <add key="language" value="" /> </appSettings> </configuration>
ru_ru: <?xml version="1.0" encoding="utf-8"?> <configuration> <appSettings> <add key="pkcs11_library" value="opensc-pkcs11.dll" /> <add key="debug" value="false" /> <add key="ocsp_url" value="http://ocsp.sk.ee" /> <add key="cert_path" value="\certs" /> <add key="enable_tsa" value="False" /> <add key="visible_signature" value="True" /> <add key="tsa_url" value="http://www.edelweb.fr/cgi-bin/service-tsp" /> <add key="tsa_user" value="" /> <add key="tsa_password" value="" /> <add key="help_url" value="http://support.sk.ee/" /> <add key="language" value="" /> <add key="signature_page" value="1" /> <add key="signature_x" value="200" /> <add key="signature_y" value="100" /> <add key="signature_w" value="400" /> <add key="signature_h" value="150" /> <add key="signature_render" value="0" /> </appSettings> </configuration>

# ADD_SIGNATURE
source: Signing document ...
ru_ru: Подписываю документ ...

# CERT_ISSUER_MISSING
source: Invalid certificate: issuer missing
ru_ru: Недействительный сертификат: выдавший отсутствует

source: Connecting smartcard ...
ru_ru: Подсоединяюсь к смарткарте ...

# DIR_CERT_ERROR
source: Reading certifcates failed from directory:
ru_ru: Неуспешное чтение сертификатов с месторасположения:

source: Document signed!
ru_ru: Документ подписан!

source: Error
ru_ru: Ошибка

# GENERAL_EXCEPTION
source: Failure ...
ru_ru: Ошибка ...

# UI_INPUT_FILEDIALOG_FILTER
source: PDF files (*.pdf)|*.pdf
ru_ru: PDF файлы (*.pdf)|*.pdf

# UI_INPUT_FILEDIALOG_TITLE
source: Choose file
ru_ru: Выберите файл

# MISSING_INPUT
source: Choose input PDF file!
ru_ru: Выберите входящий PDF файл!

# MISSING_OUTPUT
source: Choose output PDF file!
ru_ru: Выберите выходящий PDF файл!

# OCSP_CERT_ERROR
source: OCSP certificate error!
ru_ru: Ошибка OCSP сертификата!

# UI_OUTPUT_FILEDIALOG_FILTER
source: PDF files (*.pdf)|*.pdf
ru_ru: PDF файлы (*.pdf)|*.pdf

# UI_OUTPUT_FILEDIALOG_TITLE
source: Save PDF File
ru_ru: Сохранить PDF файл

# READ_CERTS
source: Reading certificates ...
ru_ru: Считываю сертификаты ...

# READ_SETTINGS
source: Reading settings ...
ru_ru: Считываю настройки ...

# SIGNING_CANCELED
source: Signing cancelled ...
ru_ru: Подписывание прервано ...

# TSA_REQUEST
source: Making timestamp request ...
ru_ru: Делаю запрос на временную печать ...

# VERIFYING_DOCUMENT
source: Checking document ...
ru_ru: Проверяю документ ...

# VERIFYING_OCSP
source: Makig OCSP request ...
ru_ru: Делаю OCSP запрос ...

# RESPONDER_CET_MISSING
source: Responder certificate missing:
ru_ru: Сертификат ответчика отсутствует:

# ISSUER_CERT_MISSING
source: Issuer certificate missing:
ru_ru: Отсутствует сертификат издателя:

# UI_CERT_ISSUED_BY
source: Issuer
ru_ru: Издатель

# UI_CERT_ISSUED_TO
source: Issued to
ru_ru: Изданно

# UI_CERT_VALID_UNTIL
source: Valid until
ru_ru: Действителен до

source: Invalid OCSP response
ru_ru: Неверный OCSP ответ

# INVALID_OCSP_RESPONSE_COUNT
source: OCSP response failure, too many items:
ru_ru: Ошибочный OCSP ответ: слишком много предметов:

# INVALID_OCSP_STATUS
source: OCSP status error:
ru_ru: Статус OCSP неверен:

# INVALID_OCSP_TIMESLOT
source: OCSP response not in valid timeslot
ru_ru: OCSP ответ в неверное время

# INVALID_PKCS12_CERT_PRI_KEY_MISSING
source: Invalid PKCS#12 envelope: private key missing
ru_ru: Неверный PKCS#12 контейнер: отсутствует личный ключ

# INVALID_PKCS12_CERT_PUB_KEY_MISSING
source: Invalid PKCS#12 envelope: public key missing
ru_ru: Неверный контейнер: отсутствует публичный ключ

# MISSING_CONFIG_FILE
source: Configuration file missing:
ru_ru: Отсутствует файл с конфигурациями:

# OCSP_ERROR
source: Certificate: {0}, OCSP response: {1}
ru_ru: Сертификат: {0}, OCSP ответ: {1}

source: OCSP URL missing
ru_ru: Отсутствует OCSP URL

# OCSP_VERIFY_FAILED
source: OCSP check failed
ru_ru: Неуспешная OCSP проверка

# PKCS12_FILENAME_MISSING
source: PKCS#12 file name empty!
ru_ru: Имя PKCS#12 файла пустое!

source: PKCS#12 file missing:
ru_ru: PKCS#12 файл отсутствует:

# REGISTRY_SETTING_MISSING
source: Estonian ID-card registry settings missing
ru_ru: Настройки регистра Эстонской ID-карты отсутствуют

# TSA_READ_ERROR
source: {0} reading response failed
ru_ru: {0} чтение ответа прошло неуспешно

# TSA_URL_ERROR
source: {0} returned error: {1}
ru_ru: {0} возвратил ошибку: {1}

# UI_CERTIFICATES
source: Certificates
ru_ru: Сертификаты

# UI_PICK_CERTIFICATE
source: Choose certificate
ru_ru: Выберите сертификат

# UI_INPUT
source: Input:
ru_ru: Вход:

# UI_PDF_DOC
source: PDF Document
ru_ru: PDF Документ

# UI_AUTHOR
source: Author:
ru_ru: Автор:

# UI_CHOOSE_INPUT
source: Choose input
ru_ru: Выберите вход

# UI_CHOOSE_OUTPUT
source: Choose output
ru_ru: Выберите выход

# UI_CREATOR
source: Creator:
ru_ru: Создатель:

# UI_HELP_LINK
source: Help
ru_ru: Помощь

# UI_KEYWORDS
source: Keywords:
ru_ru: Ключевые слова:

# UI_OUTPUT
source: Output:
ru_ru: Выход:

# UI_PDF_METADATA
source: PDF Metadata
ru_ru: PDF Мета-данные

# UI_SETTINGS_LINK
source: Settings
ru_ru: Настройки

# UI_SIGNATURE
source: Signature
ru_ru: Подпись

# UI_SIGNATURE_DESCRIPTION
source: Description
ru_ru: Пояснение

# UI_SIGNATURE_LOCATION
source: Location
ru_ru: Местонахождение

# UI_SIGNATURE_NAME
source: Name
ru_ru: Имя

# UI_SIGNATURE_VISIBLE
source: Need visible signature
ru_ru: Требуется видимая подпись

# UI_SIGN_BUTTON
source: Sign using ID-card
ru_ru: Подписать используя ID-карту

# UI_SOFTWARE
source: Software:
ru_ru: Программное обеспечение:

# UI_STATUS
source: Status:
ru_ru: Статус:

# UI_SUBJECT
source: Subject:
ru_ru: Субъект:

# UI_TITLE
source: Title:
ru_ru: Заголовок:

# UI_EXPIRED_PIN
source: PIN expired
ru_ru: PIN просрочен

# UI_INVALID_PIN
source: PIN invalid
ru_ru: Неверный PIN

# UI_LOCKED_PIN
source: PIN locked
ru_ru: PIN заблокирован

# UI_WRONG_PIN
source: PIN incorrect
ru_ru: Неверный PIN
